# Brewfile - Applications installed via Homebrew
# Generated for macOS setup
# Updated: 2025-01-XX with all currently installed packages

# ════════════════════════════════════════════════════════════════
# TAPS
# ════════════════════════════════════════════════════════════════
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# ════════════════════════════════════════════════════════════════
# CLI TOOLS & FORMULAS
# ════════════════════════════════════════════════════════════════

# Essential System Tools
brew "mas"                           # Mac App Store CLI
brew "git"                           # Version control
brew "gh"                            # GitHub CLI
brew "coreutils"                     # GNU core utilities
brew "tree"                          # Directory structure viewer
brew "htop"                          # Process viewer
brew "mtr"                           # Network diagnostic tool
brew "trash"                         # Move files to trash safely
brew "mackup"                        # Backup application settings
brew "usage"                         # Tool usage tracker

# Modern CLI Replacements
brew "eza"                           # Modern ls replacement
brew "ripgrep"                       # Fast grep alternative
brew "fzf"                           # Fuzzy finder
brew "zoxide"                        # Smart cd replacement
brew "bat"                           # Better cat with highlighting
brew "fd"                            # Fast find alternative

# Data Processing
brew "jq"                            # JSON processor
brew "yq"                            # YAML processor

# Development Tools - Python
brew "python@3.13"                   # Python 3.13
brew "pyenv"                         # Python version management
brew "pyenv-virtualenv"              # Pyenv virtualenv plugin
brew "uv"                            # Python dependency management
brew "rye"                           # Python project manager
brew "mypy"                          # Static type checker
brew "pyright"                       # Type checker
brew "ruff"                          # Python linter/formatter
brew "sphinx-doc"                    # Documentation generator

# Development Tools - JavaScript/Node
brew "node"                          # Node.js
brew "mise"                          # Version manager (replacement for asdf)

# Development Tools - Other Languages
brew "rust"                          # Rust language
brew "openjdk"                       # OpenJDK
brew "openjdk@21"                    # OpenJDK 21

# Code Quality & Analysis
brew "shellcheck"                    # Shell script analyzer
brew "prettier"                      # Code formatter
brew "qodana"                        # JetBrains code quality platform
brew "markdown-toc"                  # Markdown table of contents generator

# Cloud & DevOps
brew "awscli"                        # AWS CLI
brew "ansible"                       # Automation tool
brew "kubernetes-cli"                # kubectl - Kubernetes CLI
brew "k9s"                           # Kubernetes TUI
brew "terraform-ls"                  # Terraform language server
brew "terraformer"                   # Generate terraform from existing infrastructure
brew "terragrunt"                    # Terraform wrapper

# Network & Security
brew "nmap"                          # Network scanner
brew "gnupg"                         # GPG encryption
brew "openfortivpn"                  # FortiVPN client
brew "ggshield"                      # GitGuardian security scanner

# Shell & Terminal
brew "zsh"                           # Z shell
brew "zsh-autosuggestions"           # Fish-like autosuggestions
brew "zsh-syntax-highlighting"       # Syntax highlighting
brew "zsh-history-substring-search"  # History search
brew "powerlevel10k"                 # ZSH theme
brew "neovim"                        # Modern vim

# Build & Development Support
brew "gradle"                        # Build automation tool
brew "mcpp"                          # C/C++ preprocessor

# Monitoring & Debugging
brew "fastfetch"                     # System info tool
brew "tailspin"                      # Log file highlighter
brew "allure"                        # Test reporting

# Utilities
brew "ice"                           # Menu bar management CLI
brew "codex"                         # AI coding assistant CLI

# ════════════════════════════════════════════════════════════════
# DESKTOP APPLICATIONS (CASKS)
# ════════════════════════════════════════════════════════════════

# Password & Security
cask "1password"                     # Password manager
cask "1password-cli"                 # 1Password CLI

# Development Tools
cask "docker"                        # Docker Desktop
cask "warp"                          # Modern terminal
cask "ghostty"                       # GPU-accelerated terminal
cask "vagrant"                       # VM management

# Cloud & DevOps
cask "google-cloud-sdk"              # Google Cloud SDK (gcloud)
cask "amazon-q"                      # Amazon Q AI assistant

# Productivity & Utilities
cask "raycast"                       # Launcher and productivity
cask "obsidian"                      # Knowledge base
cask "todoist-app"                   # Task management (prefer over MAS version)
cask "keka"                          # Archive utility (replaces The Unarchiver)
cask "jordanbaird-ice"               # Menu bar manager
cask "pearcleaner"                   # App uninstaller
cask "applite"                       # Homebrew GUI manager
cask "trunk-io"                      # Code quality toolkit

# Communication
cask "whatsapp"                      # Messaging (prefer over MAS version)

# Network & Remote
cask "winbox"                        # MikroTik management

# ════════════════════════════════════════════════════════════════
# FONTS
# ════════════════════════════════════════════════════════════════
cask "font-fira-code"                # Programming font with ligatures
cask "font-jetbrains-mono"           # JetBrains mono font
cask "font-jetbrains-mono-nerd-font" # With icons
cask "font-meslo-lg-nerd-font"       # Meslo with icons
cask "font-hack-nerd-font"           # Hack with icons
cask "font-source-code-pro"          # Adobe Source Code Pro
cask "font-cascadia-code"            # Microsoft Cascadia Code
cask "font-roboto-mono"              # Roboto Mono

# ════════════════════════════════════════════════════════════════
# MAC APP STORE APPS (via mas)
# ════════════════════════════════════════════════════════════════
# Apps that are ONLY available in Mac App Store
# These will be installed via `mas install <id>` command

# Productivity & Organization
mas "Amphetamine", id: 937984704              # Keep Mac awake
mas "MeetingBar", id: 1532419400              # Menu bar calendar
mas "Structured", id: 1499198946              # Daily planner
mas "TickTick", id: 966085870                 # Task management
mas "Tot", id: 1491071483                     # Tiny text notes

# Notes & Knowledge Management
mas "Bear", id: 1091189122                    # Note taking
mas "Craft", id: 1487937127                   # Documents & notes
mas "NotePlan", id: 1505432629                # Calendar + notes
mas "UpNote", id: 1398373917                  # Note taking

# Reading & Content
mas "Reeder 5", id: 1529448980                # RSS reader
mas "Reeder 2025", id: 6475002485             # RSS reader (new version)
mas "GoodLinks", id: 1474335294               # Read later service

# Safari Extensions
mas "Cascadea", id: 1432182561                # Custom CSS for Safari
mas "Dark Reader for Safari", id: 1438243180  # Dark mode for websites
mas "Tampermonkey", id: 1482490089            # Userscript manager
mas "1Password for Safari", id: 1569813296    # Password manager extension
mas "Web Scrobbler", id: 6449224218           # Music scrobbler

# Clipboard & Productivity Tools
mas "PastePal", id: 1503446680                # Clipboard manager
mas "Pasty", id: 1544620654                   # Clipboard manager
mas "Peek", id: 1554235898                    # Quick Look previews

# Utilities
mas "Color Picker", id: 1545870783            # System color picker
mas "Unsplash Wallpapers", id: 1284863847     # Wallpaper app
mas "Soulver 3", id: 1508732804               # Calculator with text
mas "Speedtest", id: 1153157709               # Internet speed test

# Media & Entertainment
mas "Mela", id: 1568924476                    # Recipe manager
mas "NepTunes", id: 1006739057                # Last.fm scrobbler
mas "Elmedia Player", id: 937759555           # Media player
mas "Daft Music", id: 0                       # Music player

# Email & Communication
mas "Spark Desktop", id: 6445813049           # Email client

# Apple Office Suite
mas "Keynote", id: 409183694                  # Presentations
mas "Numbers", id: 409203825                  # Spreadsheets
mas "Pages", id: 409201541                    # Word processing

# Professional Tools
mas "Jump Desktop", id: 524141863             # Remote desktop
mas "CSV Editor Pro X", id: 6477299212        # CSV editor
mas "PDFgear", id: 6469021132                 # PDF editor
mas "Fantastical", id: 975937182              # Calendar app

# Development
mas "TestFlight", id: 899247664               # Beta testing

# Health
mas "WaterMinder", id: 1415257369             # Water intake tracker
